docs/mathematics/multi_variable_calculus/KBe22math520ret3someDerivativesAndParameterization.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-20 Thu 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Problem Set 3: some derivatives and a parameterization</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>
<link rel="stylesheet" href="https://quantumish.github.io/admonition.css" />

</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Problem Set 3: some derivatives and a parameterization</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2022-01-20 Thu 15:37</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul></ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org33d82d1">1. find the third order partials of \(f(x, y) = 4x^2y^5 + 3x^3y^2\)</a></li>
<li><a href="#orgadf9114">2. for some function of \(\mathbb R ^n \to  \mathbb R ^m\), the $k$-th order partial</a></li>
<li><a href="#orgd87fb5c">3. the parameterization \(x(t) = 3t + 4, y(t) = 5t-7, - \infty < t < \infty\)</a>
<ul>
<li><a href="#orgaf04b58">3.1. equation of the line</a></li>
<li><a href="#org1391925">3.2. parameterization start</a></li>
<li><a href="#org8650df2">3.3. speed in \(x\) direction</a></li>
<li><a href="#orga051fa8">3.4. speed in \(y\) direction</a></li>
<li><a href="#orga072add">3.5. actual speed</a></li>
</ul>
</li>
</ul>
</div></div>
</div>
<div id="outline-container-org33d82d1" class="outline-2">
<h2 id="org33d82d1"><span class="section-number-2">1</span> find the third order partials of \(f(x, y) = 4x^2y^5 + 3x^3y^2\)</h2>
<div class="outline-text-2" id="text-1">
<p>
\[\begin{aligned}
  \frac{\partial}{\partial x} &= 8x y^5 + 9 x^2 y^2\\
  \frac{\partial}{\partial y} &= 20x^2 y^4 + 6 x^3 y\\
  \frac{\partial^2}{\partial x^2 } &= 8 y^5 + 18 x y^2\\
  \frac{\partial^2}{\partial x \partial y} &= 40x y^4 + 18 x^2 y\\
  \frac{\partial^2}{\partial y^2 } &= 80x^2 y^3 + 6 x^3\\
  \frac{\partial^3}{\partial x^3 } &= 18 y^2\\
  \frac{\partial^3}{\partial^2 x \partial y} &= 40 y^4 + 36 x y\\
  \frac{\partial^3}{\partial x \partial^2 y} &= 160x y^3 + 18 x^2\\
  \frac{\partial^3}{\partial y^3 } &= 240x^2 y^2\\
  \end{aligned}\]
</p>
</div>
</div>
<div id="outline-container-orgadf9114" class="outline-2">
<h2 id="orgadf9114"><span class="section-number-2">2</span> for some function of \(\mathbb R ^n \to  \mathbb R ^m\), the $k$-th order partial</h2>
<div class="outline-text-2" id="text-2">
<p>
can have up to \(\frac{{kn \choose k}}{k!}\) possible partials???? I was going to tackle this but I realized that I have significant amounts of one-night homework. Will return.
</p>

<p>
Well, for \(n = 2\), there can be up to \(k+1\) $k$-th order partials.
</p>
</div>
</div>
<div id="outline-container-orgd87fb5c" class="outline-2">
<h2 id="orgd87fb5c"><span class="section-number-2">3</span> the parameterization \(x(t) = 3t + 4, y(t) = 5t-7, - \infty < t < \infty\)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgaf04b58" class="outline-3">
<h3 id="orgaf04b58"><span class="section-number-3">3.1</span> equation of the line</h3>
<div class="outline-text-3" id="text-3-1">
<p>
I feel like there must be a better way of doing this. However, I shall have to find the slope and y-intercept manually.
</p>

<p>
y-intercept:
\[\begin{aligned}
x(t) &= 3t + 4 = 0\\
3t &= -4\\
t &= -\frac{4}{3}\\
y \left( -\frac{4}{3} \right)  &= - \frac{20}{3} - 7 = -\frac{41}{3}
\end{aligned}\]
</p>

<p>
Slope:
</p>

<p>
\[\begin{aligned}
\frac{d}{dt} y(t) &= 5\\
\frac{d}{dt} x(t) &= 3
\frac{\frac{dy}{dt}}{\frac{dx}{dt}} &= \frac{dy}{dx} = \frac{5}{3}
\end{aligned}\]
</p>

<p>
Thus, the equation for the line is
</p>

<p>
\[\begin{aligned}
\boxed{ y = \frac{5}{3}x - \frac{41}{3} }
\end{aligned}\]
</p>
</div>
</div>
<div id="outline-container-org1391925" class="outline-3">
<h3 id="org1391925"><span class="section-number-3">3.2</span> parameterization start</h3>
<div class="outline-text-3" id="text-3-2">
<p>
\[\begin{aligned}
 \left( x(0), y(0) \right)  = ( 4, -7 )
\end{aligned}\]
</p>
</div>
</div>
<div id="outline-container-org8650df2" class="outline-3">
<h3 id="org8650df2"><span class="section-number-3">3.3</span> speed in \(x\) direction</h3>
<div class="outline-text-3" id="text-3-3">
<p>
\[\begin{aligned}
\frac{d}{dt} x(t) = \boxed{3}
\end{aligned}\]
</p>
</div>
</div>
<div id="outline-container-orga051fa8" class="outline-3">
<h3 id="orga051fa8"><span class="section-number-3">3.4</span> speed in \(y\) direction</h3>
<div class="outline-text-3" id="text-3-4">
<p>
\[\begin{aligned}
\frac{d}{dt} y(t) = \boxed{5}
\end{aligned}\]
</p>
</div>
</div>
<div id="outline-container-orga072add" class="outline-3">
<h3 id="orga072add"><span class="section-number-3">3.5</span> actual speed</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Lets find the velocity vector first
\[\begin{aligned}
\vec{v} = \frac{d}{dt} ( x(t), y(t) ) = (3, 5)
\end{aligned}\]
</p>

<p>
The magnitude of that velocity vector is 
</p>

<p>
\[\begin{aligned}
\lvert \vec{v} \rvert  = \sqrt{3^2 + 5^2} = \boxed{5.83}
\end{aligned}\]
</p>
</div>
</div>
</div>
</div>
</body>
</html>
